---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyConstraintError
source: html/73d187f1-a65b-88cd-152b-5c378488d5e6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyConstraintError Property

Highlighted constraints cause a circular chain of references.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencyConstraintError { get; }
```